[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@Numéro de séquence de l'observation actuelle. Pour chaque observation, $CASENUM est le nombre d'observations étudiées, jusqu'à cette observation incluse. Le format est F8.0. La valeur de $CASENUM n'est pas nécessairement le numéro de ligne d'une fenêtre de l'éditeur de données (disponible dans les environnements à fenêtre), et la valeur change si le fichier est trié ou si de nouvelles observations sont insérées avant la fin du fichier.
$sysmis10=10@$Sysmis@$SYSMIS@Valeur manquante système. La valeur manquante par défaut s'affiche sous la forme d'un point (.) ou tout signe utilisé comme indicateur décimal.
$date4=4@$Date@$DATE@Date actuelle au format international avec l'année à deux chiffres. Le format est A9 sous la forme jj-mmm-aa.
$jdate4=4@$JDate@$JDATE@Date actuelle en nombre de jours à partir du 14 octobre 1582 (1er jour du calendrier grégorien). Le format est F6.0.
$date114=4@$Date11@$DATE11@Date actuelle au format international avec l'année à quatre chiffres. Le format est A11 sous la forme jj-mmm-aaaa.
$time4=4@$Time@$TIME@Date et heure actuelles. $TIME représente le nombre de secondes écoulées depuis minuit le 14 octobre 1582, jusqu'à la date et l'heure auxquelles la commande de transformation est exécutée. Le format est F20. Vous pouvez afficher cette date dans divers formats de date différents. Vous pouvez également utiliser cette variable dans les fonctions de date et d'heure.
abs1=1@Abs@ABS(?)@ABS(exprnum). Numérique. Renvoie la valeur absolue de numexpr qui doit être numérique.
any13=13@Any@ANY(?,?)@ANY(test,value[,value,...]). Logique. Renvoie 1 ou vrai si la valeur de test correspond à l'une des valeurs ultérieures. Renvoie 0 ou faux dans le cas contraire. Cette fonction nécessite deux arguments ou plus. Par exemple, ANY(var1, 1, 3, 5) retourne 1 si la valeur de var1 est 1, 3 ou 5 et 0 pour les autres valeurs. ANY peut être également utilisé pour rechercher une valeur dans une liste de variables ou d'expressions. Par exemple, ANY(1, var1, var2, var3) retourne 1 si l'une de ces trois variables a la valeur 1, et 0 si toutes les variables ont des valeurs différentes de 1.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value). Numérique. Applique une fonction de scoring particulière aux données d'entrée en utilisant le modèle spécifié par l'argument traiter et où l'argument "fonction" est l'une de ces valeurs littérales chaînes, spécifiées entre guillemets : predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Le descripteur de modèle est le nom associé au fichier XML externe, tel que défini sur la commande MODEL HANDLE. Le troisième argument facultatif s'applique lorsque la fonction est "probability", "neighbor" ou "distance". Pour "probability", il spécifie une catégorie pour laquelle la probabilité est calculée. Pour "neighbor" et "distance", il spécifie un voisin particulier (comme un nombre entier) pour les modèles d'agrégation suivant le saut minimum. La fonction ApplyModel renvoie une valeur manquante par défaut si aucune valeur ne peut être calculée.
arsin1=1@Arsin@ARSIN(?)@ARSIN(exprnum). Numérique. Renvoie le sinus inverse, en radians, de l'expression numérique qui doit avoir pour résultat une valeur numérique comprise entre -1 et +1.
artan1=1@Artan@ARTAN(?)@ARTAN(exprnum). Numérique. Renvoie la tangente inverse, en radians, d'une expression qui doit être numérique.
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(quant, prob). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Bernoulli, avec le paramètre de probabilité indiqué, sera inférieure ou égale à quant.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(quant, shape1, shape2). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Bêta, avec des paramètres de forme indiqués, sera inférieure à quant.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(quant, n, prob). Numérique. Renvoie la probabilité cumulée que le nombre de succès dans n tentatives, avec une probabilité prob de succès dans chaque tentative, sera inférieur ou égal à quant. Lorsque n est 1, équivalent à CDF.BERNOULLI.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, corr). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution gaussienne bivariée standard, avec le paramètre de corrélation indiqué, sera inférieure à quant1 et quant2.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(quant, loc, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Cauchy, avec des paramètres emplacement et échelle indiqués, sera inférieure à quant.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(quant, df). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Khi-deux, avec les degrés de liberté ddl indiqués, sera inférieure à quant.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(quant, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution exponentielle, avec le paramètre échelle indiqué, sera inférieure à quant.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(quant, df1, df2). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution F, avec les degrés de liberté ddl1 et ddl2, sera inférieure à quant.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(quant, shape, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Gamma, avec les paramètres forme et échelle indiqués, sera inférieure à quant.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(quant, prob). Numérique. Renvoie la probabilité cumulée que le nombre de tentatives requises pour obtenir un succès, lorsque la probabilité de succès est indiquée par prob, sera inférieur ou égal à quant.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(quant, mean, stddev). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution semi-normale, avec la moyenne et l'écart-type spécifiés, sera inférieure à quant.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(quant, total, sample, hits). Numérique. Renvoie la probabilité cumulée que le nombre d'objets avec une caractéristique spécifiée, lorsque des objets échantillon sont sélectionnés de manière aléatoire dans un univers de taille total dans lequel les résultats ont la caractéristique spécifiée, sera inférieur ou égal à quant.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(quant, loc, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution gaussienne inverse, avec des paramètres d'emplacement et d'échelle donnés, sera inférieure à quant.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(quant, mean, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Laplace, avec les paramètres moyenne et échelle spécifiés, sera inférieure à quant.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(quant, a, b). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution logarithmique normale, avec les paramètres spécifiés, sera inférieure à quant.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(quant, mean, scale). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution logistique, avec les paramètres moyenne et échelle spécifiés, sera inférieure à quant.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(quant, thresh, prob). Numérique. Renvoie la probabilité cumulée que le nombre de tentatives requises pour parvenir à un succès, lorsque le paramètre de seuil est seuil et que la probabilité de succès est donnée par prob, sera inférieur ou égal à quant.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(quant, mean, stddev). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution normale, avec la moyenne et l'écart-type spécifiés, sera inférieure à quant.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(quant, threshold, shape). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Pareto, avec les paramètres seuil et forme spécifiés, sera inférieure à quant.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(quant, mean). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Poisson, avec le paramètre moyenne ou taux spécifié, sera inférieure ou égale à quant.
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(quant, a, b). Numérique. Renvoie la probabilité cumulée qu'une valeur du modulus maximum selon Student, avec les paramètres spécifiés, sera inférieure à quant.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(quant, a, b). Numérique. Renvoie la probabilité cumulée qu'une valeur de la statistique d'intervalle selon Student, avec les paramètres spécifiés, sera inférieure à quant.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(quant, df). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution t de Student, avec les degrés de liberté ddl spécifiés, sera inférieure à quant.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(quant, min, max). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution uniforme, avec le minimum et le maximum spécifiés, sera inférieure à quant.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(quant, a, b). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution de Weibull, avec les paramètres spécifiés, sera inférieure à quant.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zvalue). Numérique. Renvoie la probabilité qu'une variable aléatoire de moyenne 0 et écart-type 1 sera inférieure à valeurcr, qui doit être numérique.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(numexpr,numexpr[,...]). Numérique. Renvoie le coefficient de variation (l'écart-type divisé par la moyenne) des arguments dont les valeurs sont valides. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numérique. Retourne un nombre qui indique la position de la première occurrence de la chaîne aiguille dans bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Chaque sous-chaîne est utilisée pour la recherche et la fonction retourne la première occurence de n'importe quelle sous-chaîne. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la chaîne complète « abcd » dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la première occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la première occurrence de « ab » ou « cd ». Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Renvoie 0 si aiguille ne figure pas dans bottedefoin.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numérique. Retourne un nombre qui indique la position de la première occurrence de la chaîne aiguille dans bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Chaque sous-chaîne est utilisée pour la recherche et la fonction retourne la première occurence de n'importe quelle sous-chaîne. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la chaîne complète « abcd » dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la première occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la première occurrence de « ab » ou « cd ». Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Renvoie 0 si aiguille ne figure pas dans bottedefoin.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numérique. Retourne un nombre qui indique la position de la première occurrence de la chaîne aiguille dans bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Chaque sous-chaîne est utilisée pour la recherche et la fonction retourne la première occurence de n'importe quelle sous-chaîne. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la chaîne complète « abcd » dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la première occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la première occurrence de « ab » ou « cd ». Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Renvoie 0 si aiguille ne figure pas dans bottedefoin.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numérique. Retourne un nombre qui indique la position de la première occurrence de la chaîne aiguille dans bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Chaque sous-chaîne est utilisée pour la recherche et la fonction retourne la première occurence de n'importe quelle sous-chaîne. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la chaîne complète « abcd » dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la première occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la première occurrence de « ab » ou « cd ». Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Renvoie 0 si aiguille ne figure pas dans bottedefoin.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(strexpr). Numérique. Retourne la longueur de strexpr en caractères avec les espaces de droite supprimés.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(strexpr1,length[,strexpr2]). Chaîne. Insère strexpr à gauche dans strexpr1 pour que sa longueur soit égale à la valeur length en utilisant autant de copies complètes possibles de strexpr2. La valeur de longueur représente le nombre de caractères et elle doit correspondre à un entier positif. Si l'argument facultatif strexpr2 n'est pas défini, la valeur est insérée avec des espaces.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(strexpr1,length[,strexpr2]). Chaîne. Insère strexpr à gauche dans strexpr1 pour que sa longueur soit égale à la valeur length en utilisant autant de copies complètes possibles de strexpr2. La valeur de longueur représente le nombre de caractères et elle doit correspondre à un entier positif. Si l'argument facultatif strexpr2 n'est pas défini, la valeur est insérée avec des espaces.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(strexpr,pos). Numérique. Retourne le nombre d'octets dans le caractère dans la position du caractère de strexpr.
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numérique. Renvoie un entier qui indique la position de départ de la dernière occurrence de la chaîne aiguille dans la chaîne bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la dernière occurrence de la chaîne complète "abcd" dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la dernière occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la dernière occurrence de "ab" ou "cd". Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Si aiguille est introuvable, la valeur 0 est retournée.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numérique. Renvoie un entier qui indique la position de départ de la dernière occurrence de la chaîne aiguille dans la chaîne bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la dernière occurrence de la chaîne complète "abcd" dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la dernière occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la dernière occurrence de "ab" ou "cd". Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Si aiguille est introuvable, la valeur 0 est retournée.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numérique. Renvoie un entier qui indique la position de départ de la dernière occurrence de la chaîne aiguille dans la chaîne bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la dernière occurrence de la chaîne complète "abcd" dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la dernière occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la dernière occurrence de "ab" ou "cd". Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Si aiguille est introuvable, la valeur 0 est retournée.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numérique. Renvoie un entier qui indique la position de départ de la dernière occurrence de la chaîne aiguille dans la chaîne bottedefoin. Le troisième argument facultatif, diviseur, est un nombre de caractères utilisé pour diviser aiguille en chaînes distinctes. Par exemple, CHAR.INDEX(var1, 'abcd') renvoie la valeur de la position de début de la dernière occurrence de la chaîne complète "abcd" dans la variable chaîne var1, CHAR.INDEX(var1, 'abcd', 1) renvoie la valeur de la position de la dernière occurrence de n'importe quelle valeur de la chaîne et CHAR.INDEX(var1, 'abcd', 2) renvoie la valeur de la dernière occurrence de "ab" ou "cd". Le diviseur doit être un entier positif exactement divisible par la longueur d'aiguille. Si aiguille est introuvable, la valeur 0 est retournée.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(strexpr1,length[,strexpr2]). Chaîne. Insère strexpr2 à droite dans strexpr1 pour que sa longueur soit égale à la valeur length en utilisant autant de copies complètes possibles de strexpr2. La valeur de longueur représente le nombre de caractères et elle doit correspondre à un entier positif. Le troisième argument facultatuf strexpr2 est une chaîne entre guillemets ou une expression qui génère une chaîne. Si chaîne2 est omise, la valeur est complétée avec des blancs.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(strexpr1,length[,strexpr2]). Chaîne. Insère strexpr2 à droite dans strexpr1 pour que sa longueur soit égale à la valeur length en utilisant autant de copies complètes possibles de strexpr2. La valeur de longueur représente le nombre de caractères et elle doit correspondre à un entier positif. Le troisième argument facultatuf strexpr2 est une chaîne entre guillemets ou une expression qui génère une chaîne. Si chaîne2 est omise, la valeur est complétée avec des blancs.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(strexpr,pos[,length]). Chaîne. Retourne la sous-chaîne à la position de caractères pos de strexpr. Le troisième argument facultatif représente le nombre de caractères dans la sous-chaîne. Si la longueur de l'argument facultatif n'est pas définie, la sous-chaîne qui commence à la positinon de caractères pos de strexpr et s'étend jusqu'à la fin de strexpr. Par exemple, CHAR.SUBSTR('abcd', 2) retourne 'bcd' et CHAR.SUBSTR('abcd', 2, 2) retourne 'bc'.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(strexpr,pos[,length]). Chaîne. Retourne la sous-chaîne à la position de caractères pos de strexpr. Le troisième argument facultatif représente le nombre de caractères dans la sous-chaîne. Si la longueur de l'argument facultatif n'est pas définie, la sous-chaîne qui commence à la positinon de caractères pos de strexpr et s'étend jusqu'à la fin de strexpr. Par exemple, CHAR.SUBSTR('abcd', 2) retourne 'bcd' et CHAR.SUBSTR('abcd', 2, 2) retourne 'bc'.
concat16=16@Concat@CONCAT(?,?)@CONCAT(strexpr,strexpr[,..]). Chaîne. Renvoie une chaîne qui est la concaténation de tous les arguments, qui doivent être des chaînes. Cette fonction nécessite deux arguments ou plus. En mode Page de codes, si strexpr est une variable chaîne, utilisez RTRIM si vous voulez obtenir uniquement la valeur chaîne sans les insertions de droite pour la longeur de variable définie. Par exemple, CONCAT(RTRIM(stringvar1), RTRIM(stringvar2)).
cos1=1@Cos@COS(?)@COS(radians). Numérique. Renvoie le cosinus de radians, qui doit être une valeur numérique, mesuré en radians.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(timevalue). Numérique. Renvoie le nombre de jours, y compris les jours fractionnés, dans valeurtemps, qui doit être un nombre de secondes, une valeur temps, ou une expression au format de temps.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(timevalue). Numérique. Renvoie le nombre de jours, y compris les jours fractionnés, dans valeurtemps, qui doit être un nombre de secondes, une expression de temps ou une variable de format de temps.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(timevalue). Numérique. Renvoie le nombre de jours, y compris les jours fractionnés, dans valeurtemps, qui doit être un nombre de secondes, une expression de temps ou une variable de format de temps.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(timevalue). Numérique. Renvoie le nombre de jours, y compris les jours fractionnés, dans valeurtemps, qui doit être un nombre de secondes, une expression de temps ou une variable de format de temps.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(day,month,year). Numérique. Renvoie une valeur de date correspondant au jour, au mois et à l'année indiqués. Les arguments doivent correspondre à des nombres entiers, avec le jour compris entre 1 et 31, le mois compris entre 1 et 13, et l'année à un entier à quatre chiffres supérieur à 1582. Pour afficher le résultat sous forme de date, affectez un format de date à la variable de résultat.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(month,day,year). Numérique. Renvoie une valeur de date correspondant au mois, au jour et à l'année indiqués. Les arguments doivent correspondre à des nombres entiers, avec le jour compris entre 1 et 31, le mois compris entre 1 et 13, et l'année à un entier à quatre chiffres supérieur à 1582. Pour afficher le résultat sous forme de date, affectez un format de date à la variable de résultat.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(month,year). Numérique. Renvoie une valeur de date correspondant au mois et à l'année spécifiés. Les arguments doivent être des entiers, le mois étant compris entre 1 et 13 et l'année étant un nombre de quatre chiffres supérieur à 1582. Pour afficher le résultat sous la forme d'une date, affectez un format de date à la variable de résultat.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(quarter,year). Numérique. Renvoie une valeur de date correspondant au trimestre et à l'année indiqués. Les arguments doivent être des entiers, le trimestre étant compris entre 1 et 4 et l'année étant un nombre de quatre chiffres supérieur à 1582. Pour afficher le résultat sous la forme d'une date, affectez un format de date à la variable de résultat.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(weeknum,year). Numérique. Renvoie une valeur de date correspondant au numsem et à l'année spécifiés. Les arguments doivent être des entiers, le numéro de semaine étant compris entre 1 et 53 et l'année étant un nombre de quatre chiffres supérieur à 1582. La valeur de date renvoyée représente le premier jour de la semaine spécifiée pour cette année. La première semaine débute le 1er janvier de chaque année, ainsi la date renvoyée pour chaque année donnée sera différente en fonction de l'année.Pour afficher le résultat sous la forme d'une date, appliquez un format de date à la variable.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(year,daynum). Numérique. Renvoie une valeur de date correspondant à l'année et au numjour indiqués. Les arguments doivent être des entiers, le numéro du jour étant compris entre 1 et 366 et l'année étant un nombre de quatre chiffres supérieur à 1582. Pour afficher le résultat sous la forme d'une date, affectez un format de date à la variable de résultat.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit"). Numérique. Calcule la différence entre deux valeurs de date/d'heure et renvoie un entier (tout composant de fraction étant tronqué) dans les unités de date/d'heure spécifiées, dateheure2 et dateheure1 étant des variables de format de date ou d'heure (ou des valeurs numériques représentant des valeurs de date/d'heure valides), et "unité", l'une des valeurs littérales chaîne suivantes, à placer entre guillemets : years, quarters, months, weeks, days, hours, minutes, seconds.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method"). Numérique. Calcule une valeur de date ou d'heure, un nombre spécifié d'unités à partir d'une valeur de date ou d'heure donnée, dateheure étant une variable de format de date ou d'heure (ou une valeur numérique représentant une valeur de date/d'heure valide), et "unité" l'une des valeurs littérales chaîne suivantes, à placer entre guillemets : years, quarters, months, weeks, days, hours, minutes, seconds. La méthode en option, à placer entre guillemets, peut être "rollover" ou "closest". La méthode "rollover" avance les jours en trop au mois suivant. La méthode "closest" utilise la date valable la plus proche du mois (valeur par défaut). La valeur renvoyée est une valeur de date/d'heure exprimée sous la forme d'un nombre de secondes. Pour afficher la valeur au format date/heure, affectez le format approprié à la variable.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method"). Numérique. Calcule une valeur de date ou d'heure, un nombre spécifié d'unités à partir d'une valeur de date ou d'heure donnée, dateheure étant une variable de format de date ou d'heure (ou une valeur numérique représentant une valeur de date/d'heure valide), et "unité" l'une des valeurs littérales chaîne suivantes, à placer entre guillemets : years, quarters, months, weeks, days, hours, minutes, seconds. La méthode en option, à placer entre guillemets, peut être "rollover" ou "closest". La méthode "rollover" avance les jours en trop au mois suivant. La méthode "closest" utilise la date valable la plus proche du mois (valeur par défaut). La valeur renvoyée est une valeur de date/d'heure exprimée sous la forme d'un nombre de secondes. Pour afficher la valeur au format date/heure, affectez le format approprié à la variable.
exp1=1@Exp@EXP(?)@EXP(numexpr). Numérique. Renvoie e élevé à la puissance numexpr, où e est la base des logarithmes naturels et numexpr est numérique. Des valeurs importantes de numexpr peuvent produire des résultats supérieurs aux capacités de l'ordinateur.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(prob, shape1, shape2). Numérique. Renvoie la valeur de la distribution Bêta, avec les paramètres forme indiqués, dont la probabilité cumulée est prob.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, scale). Numérique. Renvoie la valeur de la distribution de Cauchy, avec les paramètres empl et échelle indiqués, dont la probabilité cumulée est prob.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(prob, df). Numérique. Renvoie la valeur de la distribution Khi-deux, avec les degrés de liberté spécifiés, dont la probabilité cumulée est prob. Par exemple, la valeur Khi-deux significative au niveau 0.05 avec 3 degrés de liberté est IDF.CHISQ(0.95,3).
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, scale). Numérique. Renvoie la valeur d'une variable s'altérant de façon exponentielle, dont le taux d'altération est échelle et la probabilité cumulée est p.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(prob, df1, df2). Numérique. Renvoie la valeur de la distribution F, avec les degrés de liberté spécifiés, dont la probabilité cumulée est prob. Par exemple, la valeur F significative au niveau 0,05 avec 3 et 100 degrés de liberté est IDF.F(0.95,3,100).
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(prob, shape, scale). Numérique. Renvoie la valeur de la distribution Gamma, avec les paramètres forme et échelle spécifiés, dont la probabilité cumulée est prob.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(prob, mean, stddev). Numérique. Renvoie la valeur de la distribution semi-normale, avec la moyenne et l'écart-type spécifiés, dont la probabilité cumulée est prob.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(prob, loc, scale). Numérique. Renvoie la valeur de la distribution gaussienne inverse, avec les paramètres d'emplacement et d'échelle indiqués, dont la probabilité cumulée est prob.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(prob, mean, scale). Numérique. Renvoie la valeur de la distribution de Laplace, avec les paramètres moyenne et échelle spécifiés, dont la probabilité cumulée est prob.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(prob, a, b). Numérique. Renvoie la valeur de la distribution logarithmique normale, avec les paramètres spécifiés, dont la probabilité cumulée est prob.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(prob, mean, scale). Numérique. Renvoie la valeur de la distribution logistique, avec les paramètres moyenne et échelle spécifiés, dont la probabilité cumulée est prob.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(prob, mean, stddev). Numérique. Renvoie la valeur de la distribution normale, avec la moyenne et l'écart-type spécifiés, dont la probabilité cumulée est prob.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(prob, threshold, shape). Numérique. Renvoie la valeur de la distribution de Pareto, avec les paramètres seuil et forme spécifiés, dont la probabilité cumulée est prob.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(prob, a, b). Numérique. Renvoie la valeur du modulus maximum de Student, avec les paramètres spécifiés, dont la probabilité cumulée est prob.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(prob, a, b). Numérique. Renvoie la valeur de la statistique d'intervalle selon Student, avec les paramètres spécifiés, dont la probabilité cumulée est prob.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(prob, df). Numérique. Renvoie la valeur de la distribution t de Student, avec les degrés de liberté ddl spécifiés, dont la probabilité cumulée est prob.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(prob, min, max). Numérique. Renvoie la valeur de la distribution uniforme entre min et max dont la probabilité cumulée est prob.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(prob, a, b). Numérique. Renvoie la valeur de la distribution de Weibull, avec les paramètres spécifiés, dont la probabilité cumulée est prob.
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n]). Numérique ou alphanumérique. Valeur de variable dans l'observation précédente ou dans les n observations précédentes. Le second argument optionnel, n, doit être un entier positif ; 1 par défaut. Par exemple, prev4=LAG(gnp,4) renvoie la valeur de gnp de la quatrième observation avant l'observation courante. Pour les quatre premières observations ont des valeurs manquantes système pour prev4.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n]). Numérique ou alphanumérique. Valeur de variable dans l'observation précédente ou dans les n observations précédentes. Le second argument optionnel, n, doit être un entier positif ; 1 par défaut. Par exemple, prev4=LAG(gnp,4) renvoie la valeur de gnp de la quatrième observation avant l'observation courante. Pour les quatre premières observations ont des valeurs manquantes système pour prev4.
length16=16@Length@LENGTH(?)@LENGTH(strexpr). Numérique. Renvoie la longueur de strexpr en octets qui doit être une expression chaîne. Pour les variables chaînes, en mode Unicode, il s'agit du nombre d'octets dans chaque valeur, y compris les espace de droite, mais en mode Page de codes, il s'agit de la longueur variable, y compris les espaces de droite. Pour récupérer la longueur (en octets) sans blanc de fin en mode Page de code, utilisez LENGTH(RTRIM(chaîne)).
lg101=1@Lg10@LG10(?)@LG10(numexpr). Numérique. Renvoie le logarithme en base 10 de numexpr, qui doit être numérique et supérieur à 0.
ln1=1@Ln@LN(?)@LN(numexpr). Numérique. Renvoie le logarithme en base e de numexpr, qui doit être numérique et supérieur à 0.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(numexpr). Numérique. Renvoie le logarithme de la fonction Gamma complète de numexpr, qui doit être numérique et supérieur à 0.
lower16=16@Lower@LOWER(?)@LOWER(strexpr). Chaîne. Renvoie la chaîne en transformant les majuscules en minuscules, les autres caractères restant inchangés. L'argument peut être une variable chaîne ou une valeur. Par exemple, LOWER(name1) retourne charles si la valeur de name1 est Charles.
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(strexpr[,char]). Chaîne. Retourne strexpr avec toutes les occurrences de début de char. Si char n'est pas spécifié, les blancs de début sont supprimés. Char doit se résoudre à un caractère unique.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(strexpr[,char]). Chaîne. Retourne strexpr avec toutes les occurrences de début de char. Si char n'est pas spécifié, les blancs de début sont supprimés. Char doit se résoudre à un caractère unique.
max13=13@Max@MAX(?,?)@MAX(value,value[,..]). Numérique ou alphanumérique. Renvoie la valeur maximale des arguments dont les valeurs sont valides. Cette fonction nécessite deux arguments ou plus. Pour les valeurs numériques, vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
max15=15@Max@MAX(?,?)@MAX(value,value[,..]). Numérique ou alphanumérique. Renvoie la valeur maximale des arguments dont les valeurs sont valides. Cette fonction nécessite deux arguments ou plus. Pour les valeurs numériques, vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(strexpr,pos). Numérique. Renvoie le nombre d'octets du caractère à la position d'octet pos de chaîne.
mean15=15@Mean@MEAN(?,?)@MEAN(numexpr,numexpr[,..]). Numérique. Renvoie la moyenne arithmétique des arguments ayant des valeurs manquantes valides. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
median15=15@Median@Median(?,?)@MEDIAN(exprnum,exprnum[,..]). Numérique. Renvoie la médiane (50e centile) des arguments dont les valeurs sont valides et non manquantes. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
min13=13@Min@MIN(?,?)@MIN(value,value[,..]). Numérique ou alphanumérique. Renvoie la valeur minimale des arguments ayant des valeurs non manquantes sont valides. Cette fonction nécessite deux arguments ou plus. Pour les valeurs numériques, vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
min15=15@Min@MIN(?,?)@MIN(value,value[,..]). Numérique ou alphanumérique. Renvoie la valeur minimale des arguments ayant des valeurs non manquantes sont valides. Cette fonction nécessite deux arguments ou plus. Pour les valeurs numériques, vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
missing10=10@Missing@MISSING(?)@MISSING(variable). Logique. Renvoie 1 ou vrai si une valeur par défaut ou une valeur utilisateur manque dans la variable. L'argument doit être un nom de variable figurant dans l'ensemble de données actif.
mod1=1@Mod@MOD(?,?)@MOD(numexpr,modulus). Numérique. Renvoie le reste lorsque exprnum est divisé par modulo. Les deux arguments doivent être numériques et modulo doit être différent de 0.
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(quant, shape1, shape2, nc). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Bêta non centrée, avec les paramètres forme et non centré indiqués, sera inférieure à quant.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(quant, df, nc). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Khi-deux non centrée, avec les degrés de liberté ddl et le paramètre non centré spécifiés, sera inférieure à quant.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(quant, df1, df2, nc). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution F non centrée, avec les degrés de liberté ddl1 et ddl2, et le paramètre non centré nc, sera inférieure à quant.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(quant, df, nc). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution t de Student non centrée, avec les degrés de liberté ddl spécifiés et le paramètre non centré nc, sera inférieure à quant.
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..]). Numérique. Renvoie le nombre d'arguments dans lesquels des valeurs par défaut et des valeurs utilisateur manquent. Cette fonction nécessite un ou plusieurs arguments, qui doivent être des noms de variable dans l'ensemble de données actif.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp). Chaîne. Retourne la version normalisée de strexp. En mode Unicode, retourne NCF Unicode. En mode Page de codes, n'a aucun effet et retourne strexp non modifié. La longueur du résultat peut être différentes de la longueur de l'entrée.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(quant, shape1, shape2, nc). Numérique. Renvoie la densité de probabilité de la distribution bêta non centrée, avec les paramètres de forme et non centré spécifiés, à la valeur quant.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(quant, df, nc). Numérique. Renvoie la densité de probabilité de la distribution Khi-deux non centrée, avec les degrés de liberté ddl et le paramètre non centré spécifiés, à la valeur quant.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(quant, df1, df2, nc). Numérique. Renvoie la densité de probabilité de la distribution F non centrée, avec les degrés de liberté ddl1 et ddl2, et le paramètre non centré nc, à la valeur quant.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(quant, df, nc). Numérique. Renvoie la densité de probabilité de la distribution t de Student non centrée, avec les degrés de liberté ddl spécifiés et le paramètre non centré nc, à la valeur quant.
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname). Retourne la valeur de varname sans supprimer les espaces de droite. La valeur de varname doit être un nom de variable ; elle ne peut pas correspondre à une expression.
number3=3@Number@NUMBER(?,?)@NUMBER(strexpr,format). Numérique. Renvoie la valeur de la chaîne chaîne sous la forme d'un nombre. Le second argument, format, est le format numérique utilisé pour lire chaîne. Par exemple, NUMBER(stringDate,DATE11) convertit les chaînes contenant des dates au format général jj-mmm-aaaa en un nombre numérique de secondes qui représente cette date. (Pour afficher la valeur sous la forme d'une date, utilisez la commande FORMATS ou PRINT FORMATS.) Si la chaîne ne peut être lue en utilisant le format, cette fonction renvoie une valeur manquante par défaut.
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable[,..]). Numérique. Renvoie le nombre d'arguments dont les valeurs sont valides et non manquantes. Cette fonction nécessite un ou plusieurs arguments, qui doivent être des noms de variable dans l'ensemble de données actif.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(quant, prob). Numérique. Renvoie la probabilité qu'une valeur de la distribution de Bernoulli, avec le paramètre de probabilité donné, sera égale à quant.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(quant, shape1, shape2). Numérique. Renvoie la densité de probabilité de la distribution bêta, avec les paramètres de forme spécifiés, à la valeur quant.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(quant, n, prob). Numérique. Renvoie la probabilité que le nombre de succès dans n tentatives, avec une probabilité prob de succès dans chaque tentative, sera égale à quant. Lorsque n est 1, cette méthode est identique à PDF.BERNOULLI.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr). Numérique. Renvoie la densité de probabilité de la distribution gaussienne bivariée standard, avec le paramètre de corrélation indiqué, aux valeurs quant1 et quant2.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale). Numérique. Renvoie la densité de probabilité de la distribution de Cauchy, avec les paramètres d'emplacement et d'échelle spécifiés, à la valeur quant.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(quant, df). Numérique. Renvoie la densité de probabilité de la distribution Khi-deux, avec les degrés de liberté ddf, à la valeur quant.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(quant, shape). Numérique. Renvoie la densité de probabilité de la distribution exponentielle, avec le paramètre de forme spécifié, à la valeur quant.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(quant, df1, df2). Numérique. Renvoie la densité de probabilité de la distribution F, avec les degrés de libertés ddl1 et ddl2, à la valeur quant.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale). Numérique. Renvoie la densité de probabilité de la distribution gamma, avec les paramètres de forme et d'échelle indiqués, à la valeur quant.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(quant, prob). Numérique. Renvoie la probabilité que le nombre de tentatives requises pour obtenir un succès, lorsque la probabilité de succès prob est indiquée, sera égale à quant.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev). Numérique. Renvoie la densité de probabilité de la distribution semi-normale, avec la moyenne et l'écart-type spécifiés, à la valeur quant.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits). Numérique. Renvoie la probabilité que le nombre d'objets avec une caractéristique spécifiée, lorsque des objets échantillon sont sélectionnés de manière aléatoire dans un univers de taille total dans lequel les casfav ont la caractéristique spécifiée, sera égale à quant.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale). Numérique. Renvoie la densité de probabilité de la distribution gaussienne inverse, avec les paramètres d'emplacement et d'échelle spécifiés, à la valeur quant.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale). Numérique. Renvoie la densité de probabilité de la distribution de Laplace, avec les paramètres de moyenne et d'échelle spécifiés, à la valeur quant.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(quant, a, b). Numérique. Renvoie la densité de probabilité de la distribution logarithmique normale, avec les paramètres spécifiés, à la valeur quant.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale). Numérique. Renvoie la densité de probabilité de la distribution logistique, avec les paramètres de moyenne et d'échelle spécifiés, à la valeur quant.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob). Numérique. Renvoie la probabilité que le nombre de tentatives requises pour parvenir à un succès, lorsque le paramètre de seuil est seuil et que la probabilité de succès est prob, sera égale à quant.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev). Numérique. Renvoie la densité de probabilité de la distribution normale, avec la moyenne et l'écart-type spécifiés, à la valeur quant.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape). Numérique. Renvoie la densité de probabilité de la distribution de Pareto, avec les paramètres de seuil et de forme spécifiés, à la valeur quant.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean). Numérique. Renvoie la probabilité qu'une valeur de la distribution de Poisson, avec le paramètre de moyenne ou de taux spécifié, sera égale à quant.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df). Numérique. Renvoie la densité de probabilité de la distribution t de Student, avec les degrés de liberté ddl spécifiés, à la valeur quant.
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max). Numérique. Renvoie la densité de probabilité de la distribution uniforme, avec les valeurs minimale et maximale spécifiées, à la valeur quant.
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b). Numérique. Renvoie la densité de probabilité de la distribution de Weibull, avec les paramètres spécifiés, à la valeur quant.
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..]). Logique. Renvoie 1 ou vrai si test est à l'intérieur de l'un des intervalles défini par les paires bas, haut. Les arguments doivent tous être numériques ou être des chaînes de même longueur, et chaque paire bas, haut doit être triée selon bas <= haut. Remarque : Pour les valeurs de chaîne, les résultats peuvent différer en fonction du paramètre régional, même s'il s'agit d'un même groupe de caractères, puisque la séquence de classement utilisée est nationale. Dans la séquence, c'est l'ordre du langage, et non l'ordre ASCII, qui détermine la position de certains caractères.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Chaîne. Dans a1, les instances de a2 sont remplacées par a3. L'argument optionnel a4 spécifie le nombre d'occurrences à remplacer ; si a4 est omis, toutes les occurrences sont remplacées. Les arguments a1, a2 et a3 doivent se résoudre à des valeurs de chaîne (chaînes littérales entre guillemets ou variables de chaîne) et l'argument optionnel a4 doit se résoudre à un entier non négatif. Par exemple, REPLACE("abcabc", "a", "x") retourne la valeur de "xbcxbc" et REPLACE("abcabc", "a", "x", 1) retourne la valeur de "xbcabc".
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Chaîne. Dans a1, les instances de a2 sont remplacées par a3. L'argument optionnel a4 spécifie le nombre d'occurrences à remplacer ; si a4 est omis, toutes les occurrences sont remplacées. Les arguments a1, a2 et a3 doivent se résoudre à des valeurs de chaîne (chaînes littérales entre guillemets ou variables de chaîne) et l'argument optionnel a4 doit se résoudre à un entier non négatif. Par exemple, REPLACE("abcabc", "a", "x") retourne la valeur de "xbcxbc" et REPLACE("abcabc", "a", "x", 1) retourne la valeur de "xbcabc".
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Chaîne. Dans a1, les instances de a2 sont remplacées par a3. L'argument optionnel a4 spécifie le nombre d'occurrences à remplacer ; si a4 est omis, toutes les occurrences sont remplacées. Les arguments a1, a2 et a3 doivent se résoudre à des valeurs de chaîne (chaînes littérales entre guillemets ou variables de chaîne) et l'argument optionnel a4 doit se résoudre à un entier non négatif. Par exemple, REPLACE("abcabc", "a", "x") retourne la valeur de "xbcxbc" et REPLACE("abcabc", "a", "x", 1) retourne la valeur de "xbcabc".
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Chaîne. Dans a1, les instances de a2 sont remplacées par a3. L'argument optionnel a4 spécifie le nombre d'occurrences à remplacer ; si a4 est omis, toutes les occurrences sont remplacées. Les arguments a1, a2 et a3 doivent se résoudre à des valeurs de chaîne (chaînes littérales entre guillemets ou variables de chaîne) et l'argument optionnel a4 doit se résoudre à un entier non négatif. Par exemple, REPLACE("abcabc", "a", "x") retourne la valeur de "xbcxbc" et REPLACE("abcabc", "a", "x", 1) retourne la valeur de "xbcabc".
rnd(1)1=1@Rnd(1)@RND(?)@RND(exprnum[,mult,bitsflous]). Numérique. Avec un seul argument, renvoie le nombre entier le plus proche de cet argument. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(exprnum[,mult,bitsflous]). Numérique. Avec un seul argument, renvoie le nombre entier le plus proche de cet argument. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(exprnum[,mult,bitsflous]). Numérique. Avec un seul argument, renvoie le nombre entier le plus proche de cet argument. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. Les nombres qui se terminent exactement par ,5 sont arrondis à l'unité supérieure. Par exemple, RND(-4,5) est arrondi à -5. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur—par exemple RND(-4,57;0,1) = -4,6. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(strexpr[,char]). Chaîne. Supprime les caractères (char) situés en fin de chaîne Le second argument facultatif char est un caractère unique entre crochets ou une expression retournant un seul caractère. If char is omitted, trailing blanks are trimmed.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(strexpr[,char]). Chaîne. Supprime les caractères (char) situés en fin de chaîne Le second argument facultatif char est un caractère unique entre crochets ou une expression retournant un seul caractère. If char is omitted, trailing blanks are trimmed.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(prob). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Bernoulli avec le paramètre de probabilité prob spécifié.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(shape1, shape2). Numérique. Renvoie une valeur aléatoire à partir d'une distribution bêta avec les paramètres de forme spécifiés.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, prob). Numérique. Renvoie une valeur aléatoire à partir d'une distribution binomiale avec les paramètres de nombre de tentatives et de probabilité spécifiés.
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Cauchy avec les paramètres d'emplacement et d'échelle spécifiés.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df). Numérique. Renvoie une valeur aléatoire à partir d'une distribution Khi-deux avec les degrés de liberté ddl spécifiés.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution exponentielle avec le paramètre d'échelle spécifié.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1, df2). Numérique. Renvoie une valeur aléatoire à partir d'une distribution F avec les degrés de liberté ddl1 et ddl2 spécifiés.
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(shape, scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution Gamma avec les paramètres de forme et d'échelle spécifiés.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(prob). Numérique. Renvoie une valeur aléatoire à partir d'une distribution géométrique avec le paramètre de probabilité spécifié.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(mean, stddev). Numérique. Renvoie une valeur aléatoire à partir d'une distribution normale avec la moyenne et l'écart-type spécifiés.
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, sample, hits). Numérique. Renvoie une valeur aléatoire à partir d'une distribution hypergéométrique avec les paramètres spécifiés.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution gaussienne inverse avec les paramètres d'emplacement et d'échelle spécifiés.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(mean, scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Laplace avec les paramètres de moyenne et d'échelle spécifiés.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b). Numérique. Renvoie une valeur aléatoire à partir d'une distribution logarithmique normale avec les paramètres spécifiés.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(mean, scale). Numérique. Renvoie une valeur aléatoire à partir d'une distribution logistique avec les paramètres de moyenne et d'échelle spécifiés.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(threshold, prob). Numérique. Retourne une valeur aléatoire à partir d'une distribution binomiale négative avec les paramètres de seuil et de probabilité spécifiés.
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(mean, stddev). Numérique. Retourne une valeur aléatoire à partir d'une distribution normale avec la moyenne et l'écart-type spécifiés.
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(threshold, shape). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Pareto avec les paramètres de seuil et de forme spécifiés.
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(mean). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Poisson avec le paramètre de moyenne ou de taux spécifié.
rv.t12=12@Rv.T@RV.T(?)@RV.T(df). Numérique. Renvoie une valeur aléatoire à partir d'une distribution t de Student avec les degrés de liberté ddl spécifiés.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min, max). Numérique. Renvoie une valeur aléatoire à partir d'une distribution uniforme avec les minimum et maximum spécifiés. Voir aussi la fonction UNIFORM.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b). Numérique. Renvoie une valeur aléatoire à partir d'une distribution de Weibull avec les paramètres spécifiés.
sd15=15@Sd@SD(?,?)@SD(numexpr,numexpr[,..]). Numérique. Renvoie l'écart-type des arguments ayant des valeurs non manquantes valides. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(quant, df). Numérique. Renvoie la probabilité cumulée qu'une valeur de la distribution Khi-deux, avec les degrés de liberté ddl spécifiés, sera supérieure à quant.
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(quant, df1, df2). Numérique. Retourne la probabilité cumulée qu'une valeur de la distribution F, avec les degrés de liberté ddl1 et ddl2, sera supérieure à quant.
sin1=1@Sin@SIN(?)@SIN(radians). Numérique. Renvoie le sinus de radians, qui doit être une valeur numérique, mesurée en radians.
sqrt1=1@Sqrt@SQRT(?)@SQRT(numexpr). Numérique. Renvoie la racine carrée positive de numexpr, qui doit être numérique et non négative.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value). Chaîne. Applique une fonction de scoring particulière aux données d'entrée en utilisant le modèle spécifié par l'argument traiter et où l'argument "fonction" est l'une de ces valeurs littérales chaînes, spécifiées entre guillemets : predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Le descripteur de modèle est le nom associé au fichier XML externe, tel que défini sur la commande MODEL HANDLE. Le troisième argument facultatif s'applique lorsque la fonction est "probability", "neighbor" ou "distance". Pour "probability", il spécifie une catégorie pour laquelle la probabilité est calculée. Pour "neighbor" et "distance", il spécifie un voisin particulier (comme un nombre entier) pour les modèles d'agrégation suivant le saut minimum. StrApplyModel renvoie une chaîne de caractères vide si une valeur ne peut pas être calculée.
string3=3@String@STRING(?,?)@STRING(numexpr,format). Chaîne. Renvoie la chaîne résultant de la conversion de numexpr en chaîne selon le format. STRING(-1.5,F5.2) renvoie la valeur chaîne '-1.50'. Le second argument, format, doit permettre d'écrire une valeur numérique.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(strexp, length). Chaîne. Renvoie chaîne tronquée à longueur (en octets), puis débarrassée de tout blanc de fin. La troncature supprime les fragments d'un caractère qui doit être tronqué.
sum15=15@Sum@SUM(?,?)@SUM(numexpr,numexpr[,..]). Numérique. Renvoie la somme de ses arguments ayant des valeurs non manquantes valides. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(numvar). Logique. Renvoie 1 ou vrai si la valeur de varnum est manquante par défaut. L'argument varnum doit être le nom d'une variable numérique figurant dans l'ensemble de données actif.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(days). Numérique. Renvoie un intervalle de temps correspondant au nombre de jours indiqué. L'argument doit être numérique. Pour afficher le résultat sous la forme d'un temps, affectez un format de temps à la variable de résultat.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(hours[,minutes,seconds]). Numérique. Renvoie un intervalle de temps correspondant au nombre d'heures, de minutes et de secondes indiqué. Les arguments de minutes et de secondes sont facultatifs. Les minutes et les secondes doivent donner des valeurs inférieures à 6° si un argument d'ordre supérieur est différent de zéro. Tous les arguments, sauf le dernier argument différent de zéro, doivent donner des entiers. Par exemple TIME.HMS(25.5) et TIME.HMS(0,90,25.5) sont corrects, mais TIME.HMS(25.5,30) et TIME.HMS(25,90) ne les sont pas. Tous les arguments doivent donner des valeurs positives ou négatives. Pour afficher le résultat sous la forme d'un temps, affectez un format de temps à la variable de résultat.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(hours[,minutes,seconds]). Numérique. Renvoie un intervalle de temps correspondant au nombre d'heures, de minutes et de secondes indiqué. Les arguments de minutes et de secondes sont facultatifs. Les minutes et les secondes doivent donner des valeurs inférieures à 6° si un argument d'ordre supérieur est différent de zéro. Tous les arguments, sauf le dernier argument différent de zéro, doivent donner des entiers. Par exemple TIME.HMS(25.5) et TIME.HMS(0,90,25.5) sont corrects, mais TIME.HMS(25.5,30) et TIME.HMS(25,90) ne les sont pas. Tous les arguments doivent donner des valeurs positives ou négatives. Pour afficher le résultat sous la forme d'un temps, affectez un format de temps à la variable de résultat.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(hours[,minutes,seconds]). Numérique. Renvoie un intervalle de temps correspondant au nombre d'heures, de minutes et de secondes indiqué. Les arguments de minutes et de secondes sont facultatifs. Les minutes et les secondes doivent donner des valeurs inférieures à 6° si un argument d'ordre supérieur est différent de zéro. Tous les arguments, sauf le dernier argument différent de zéro, doivent donner des entiers. Par exemple TIME.HMS(25.5) et TIME.HMS(0,90,25.5) sont corrects, mais TIME.HMS(25.5,30) et TIME.HMS(25,90) ne les sont pas. Tous les arguments doivent donner des valeurs positives ou négatives. Pour afficher le résultat sous la forme d'un temps, affectez un format de temps à la variable de résultat.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(exprnum,mult,bitsflous). Numérique. Renvoie la valeur de exprnum amputée de sa partie décimale. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur— par exemple, TRUNC(4,579;0,1) = 4,5. Cette valeur doit être numérique mais ne peut pas être 0. La valeur par défaut est 1. Le troisième argument facultatif, bitsflous, est le nombre d'octets les moins significatifs par lesquels la valeur exprnum peut rester éloignée de la limite d'arrondi la plus proche, et être arrondie avant la troncature. Par exemple, si exprnum est située entre 1,4 et 1,5 et mult est égale à 0,1 alors bitsflous indique l'écart que peut conserver la valeur exprnum par rapport à 1,5 (la limite la plus proche) tout en restant arrondie. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(exprnum,mult,bitsflous). Numérique. Renvoie la valeur de exprnum amputée de sa partie décimale. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur— par exemple, TRUNC(4,579;0,1) = 4,5. Cette valeur doit être numérique mais ne peut pas être 0. La valeur par défaut est 1. Le troisième argument facultatif, bitsflous, est le nombre d'octets les moins significatifs par lesquels la valeur exprnum peut rester éloignée de la limite d'arrondi la plus proche, et être arrondie avant la troncature. Par exemple, si exprnum est située entre 1,4 et 1,5 et mult est égale à 0,1 alors bitsflous indique l'écart que peut conserver la valeur exprnum par rapport à 1,5 (la limite la plus proche) tout en restant arrondie. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(exprnum,mult,bitsflous). Numérique. Renvoie la valeur de exprnum amputée de sa partie décimale. Le second argument facultatif, mult, indique que le résultat est un nombre entier multiple de cette valeur— par exemple, TRUNC(4,579;0,1) = 4,5. Cette valeur doit être numérique mais ne peut pas être 0. La valeur par défaut est 1. Le troisième argument facultatif, bitsflous, est le nombre d'octets les moins significatifs par lesquels la valeur exprnum peut rester éloignée de la limite d'arrondi la plus proche, et être arrondie avant la troncature. Par exemple, si exprnum est située entre 1,4 et 1,5 et mult est égale à 0,1 alors bitsflous indique l'écart que peut conserver la valeur exprnum par rapport à 1,5 (la limite la plus proche) tout en restant arrondie. En cas d'omission, le paramètre système de FUZZBITS (défini sur 6 au moment de l'installation) est utilisé.
upcase16=16@Upcase@UPCASE(?)@UPCASE(strexpr). Chaîne. Renvoie la chaîne en transformant les minuscules en majuscules, les autres caractères restant inchangés.
value10=10@Value@VALUE(?)@VALUE(variable). Numérique ou alphanumérique. Retourne la valeur de variable, sans tenir compte des définitions de valeurs manquantes spécifiées pour la variable, qui doit être un nom de variable ou une référence vectorielle à un nom de variable.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(varname). Chaîne. Retourne l'étiquette de valeur pour la valeur de variable ou une chaîne vide s'il n'y a pas d'étiquette pour la valeur. La valeur de varname doit être un nom de variable ; elle ne peut pas correspondre à une expression.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(numexpr,numexpr[,..]). Numérique. Renvoie la variance des arguments dont les valeurs sont valides. Cette fonction nécessite deux ou plusieurs arguments, qui doivent être numériques. Vous pouvez spécifier un nombre minimum d'arguments valides pour que cette fonction soit évaluée.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(datevalue). Numérique. Retourne la partie date d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date. Pour afficher le résultat sous la forme d'une date, appliquez un format de temps à la variable.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime). Numérique. Renvoie l'heure (un entier entre 0 et 23) à partir d'une valeur représentant une date ou une heure. L'argument peut être un nombre, une variable d'heure ou de date ou une expression dont le résultat est une heure ou une date.
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(datevalue). Numérique. Renvoie le jour de l'année (un entier entre 1 et 366) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(datevalue). Numérique. Renvoie le jour du mois (un entier entre 1 et 31) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime). Numérique. Renvoie la minute (un entier entre 0 et 59) à partir d'une valeur représentant une date ou une heure. L'argument peut être un nombre, une variable d'heure ou de date ou une expression dont le résultat est une heure ou une date.
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(datevalue). Numérique. Renvoie le mois (un entier entre 1 et 12) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(datevalue). Numérique. Renvoie le trimestre de l'année (un entier entre 1 et 4) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime). Numérique. Renvoie la seconde (un entier entre 0 et 60) à partir d'une valeur représentant une date ou une heure. L'argument peut être un nombre, une variable d'heure ou de date ou une expression dont le résultat est une heure ou une date.
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue). Numérique. Renvoie le nombre de jours entiers (sous la forme d'un entier) d'une valeur numérique qui représente un intervalle de temps. L'argument peut être un nombre, une variable de format d'heure ou une expression dont le résultat est une date.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue). Numérique. Renvoie le nombre de jours entiers (sous la forme d'un entier) d'une valeur numérique qui représente un intervalle de temps. L'argument peut être un nombre, une variable de format d'heure ou une expression dont le résultat est une date.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime). Numérique. Renvoie la portion heure d'une valeur qui représente une heure ou une valeurdate. L'argument peut être un nombre, une variable d'heure ou de date ou une expression dont le résultat est une heure ou une date. Pour afficher le résultat sous la forme d'une heure, appliquez un format d'heure à la variable.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(datevalue). Numérique. Renvoie la semaine (un entier entre 1 et 53) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(datevalue). Numérique. Renvoie le jour de la semaine (un entier entre 1, dimanche, et 7, Samedi) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(datevalue). Numérique. Renvoie l'année (sous la forme d'un entier à quatre chiffres) à partir d'une valeur numérique qui représente une date. L'argument peut être un nombre, une variable au format date, ou une expression dont le résultat est une date.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(year,month,day). Numérique. Renvoie le nombre de jours à compter entre le 15 octobre 1582 et la date représentée par les arguments année, mois et jour, qui doivent être des nombres entiers formant une date valide ultérieure au 15 octobre 1582. Les valeurs à deux chiffres de l'année supposent un siècle basé sur les paramètres d'Options (menu Edition, Options, onglet Données). Par défaut, des années à 2 chiffres supposent une plage commençant 69 années avant la date courante et finissant 30 années après.
